Repository: janboddez/jb-twikey-gateway-for-woocommerce
Catalog: languages/jb-wc-twikey-*.po
Languages: nl_be, nl_nl

source: Pre-authorized payment via Twikey
nl_nl: Incassomachtiging via Twikey

source: Sign a recurring payment mandate using a debit card, eID or text message, or use an existing mandate if you've signed one before.
nl_nl: Onderteken met je bankpas of elektronische identiteitskaart of via SMS eenmalig een incassomachtiging.

source: Enable/Disable
nl_be: Inschakelen/uitschakelen
nl_nl: Inschakelen/uitschakelen

source: Enable this payment gateway
nl_be: Schakel deze betaalmethode in
nl_nl: Deze betaalmethode inschakelen

source: Title
nl_be: Titel
nl_nl: Titel

source: Payment method name shown on checkout.
nl_be: Naam van de betaalmethode zoals tijdens het afrekenen getoond.
nl_nl: Naam van de betaalmethode zoals tijdens het afrekenen getoond.

source: Customer Message
nl_be: Boodschap aan klanten
nl_nl: Boodschap voor klanten

source: Use your debit card or eID to sign a recurring payment mandate on checkout.
nl_be: Onderteken een domiciliÃ«ringsmandaat met je bankkaart of elektronische identiteitskaart.
nl_nl: Onderteken met je bankpas of elektronische identiteitskaart eenmalig een incassomachtiging.

source: Payment method description shown on checkout.
nl_be: Naam van de betaalmethode zoals tijdens het afrekenen getoond.
nl_nl: Naam van de betaalmethode zoals tijdens het afrekenen getoond.

source: Transaction Message
nl_nl: Betalingsbericht

source: Your payment for %s.
nl_nl: Je betaling voor %s.

source: The message customers see on their bank statement after a payment was processed.
nl_nl: Het betalingsbericht dat klanten op hun bankafschrift zullen zien.

source: Your <a href="%s" target="_blank" rel="noopener">API token</a>.
nl_nl: Je <a href="%s" target="_blank" rel="noopener">API-token</a>.

source: Private Key
nl_nl: Private sleutel

source: Your <a href="%s" target="_blank" rel="noopener">private key</a>.
nl_nl: Je <a href="%s" target="_blank" rel="noopener">private sleutel</a>.

source: The unique ID of the <a href="%s" target="_blank" rel="noopener">contract template</a> to be used.
nl_nl: Het unieke ID van de te gebruiken <a href="%s" target="_blank" rel="noopener">contracttemplate</a>.

source: For this payment gateway to work correctly, you <strong>absolutely must</strong> configure all Exit URLs in the Twikey <a href="%1$s" target="_blank" rel="noopener">contract template settings</a> to %2$s.
nl_nl: Deze betalingsmethode <strong>vereist</strong> dat je in de Twikey <a href="%1$s" target="_blank" rel="noopener">contracttemplate-instellingen</a> alle Exit URL's naar %2$s wijzigt.

source: Test environment?
nl_nl: Testomgeving?

source: Check when using Twikey's test environment
nl_nl: Indien je Twikey's testomgeving gebruikt

source: Could not connect to Twikey server. If this keeps happening, please contact the store owner.
nl_nl: Kon de Twikey-server niet benaderen. Contacteer alsjeblieft de winkeluitbater als dit zich blijft voordoen.

source: No Twikey mandate ID returned. Please verify the checkout form was filled out correctly and try again.
nl_nl: Geen mandaat-ID ontvangen. Verifieer alsjeblieft je gegevens en probeer het nogmaals.

source: Payment error: invalid existing Twikey mandate status returned.
nl_nl: Betalingsfout: ongeldige Twikey-mandaatstatus ontvangen.

source: Payment error: could not get Twikey to confirm the payment request.
nl_nl: Betalingsfout: Twikey kon de betalingsaanvraag niet bevestigen.

source: Twikey payment request successfully submitted. Awaiting final payment confirmation.
nl_nl: Twikey-betalingsaanvraag succesvol verstuurd. In afwachting van betalingsbevestiging.

source: Order could not be completed: no Twikey authorization token returned.
nl_nl: Bestelling kon niet worden afgerond: geen Twikey-authorisatietoken ontvangen.

source: Invite error: no (new) Twikey mandate ID returned.
nl_nl: Uitnodigingsfout: geen (nieuw) Twikey-mandaat geretourneerd.

source: Renewal order could not be completed: the status of the Twikey mandate associated with the order is invalid.
nl_nl: Hernieuwen kon niet worden afgerond: het Twikey-mandaat dat aan de bestelling is gekoppeld heeft een ongeldige status.

source: Twikey transaction could not be added. The Twikey API responsed: '%s'.
nl_nl: Twikey-transactie kon niet worden toegevoegd. Antwoord van de Twikey-API: '%s'.

source: Your unique Twikey API token.
nl_be: Je unieke Twikey API Token.

source: The unique ID of the contract template to be used.
nl_be: Het unieke ID van de te gebruiken contracttemplate.

source: None
nl_be: Geen

source: The type of callback (if any) used to communicate back to WooCommerce after a mandate is signed.
nl_be: Het callback-type (indien van toepassing) dat Twikey gebruikt om richting WooCommerce te rapporteren dat een mandaat werd ondertekend.

source: When set to 'Webhook', you <strong>must</strong> set the callback URL in the Twikey <a href='%s' target='_blank'>API settings</a> to %s.
nl_be: Indien je 'webhook' selecteert, <strong>moet</strong> je in de <a href='%s' target='_blank'>API-instellingen</a> van Twikey de callback-URL als volgt instellen: %s.

source: When set to 'Exit URL', you <strong>must</strong> configure the Exit URL(s) in the Twikey <a href='%s' target='_blank'>contract template settings</a> to %s.
nl_be: Indien je 'exit URL' selecteert, <strong>moet</strong> je in de <a href='%s' target='_blank'>contracttemplate-instellingen</a> van Twikey de callback-URL als volgt instellen: %s.

source: Payment error: Could not connect to Twikey server. Authentication details may be incorrect.
nl_be: Betalingsfout: Kon geen verbinding maken met de Twikey-server. Mogelijk zijn de authenticatiegegevens onjuist.

source: Payment error: No Twikey mandate ID returned. Please verify the checkout form was filled out correctly and try again.
nl_be: Betalingsfout: Geen mandaat-ID ontvangen. Verifieer alstublieft uw gegevens en probeer het nogmaals.

source: Unfortunately, Twikey does not allow plus signs in email addresses.
nl_be: Helaas laat Twikey geen plustekens in e-mailadressen toe.
